In [5]:
import pandas as pd
df = pd.DataFrame({'$a':[1,2], '$b': [3,4], 
                   '$c':[5,6], '$d':[7,8], 
                   '$e':[9,10]})

df.rename({'$a':'a', '$b':'b', '$c':'c', '$d':'d', '$e':'e'}, axis='columns')

   a  b  c  d   e
0  1  3  5  7   9
1  2  4  6  8  10

In [6]:
df.rename({'$a':'a', '$b':'b', '$c':'c', '$d':'d', '$e':'e'}, axis=1)

   a  b  c  d   e
0  1  3  5  7   9
1  2  4  6  8  10

In [7]:
df.rename(columns={'$a':'a', '$b':'b', '$c':'c', '$d':'d', '$e':'e'})

   a  b  c  d   e
0  1  3  5  7   9
1  2  4  6  8  10